[
    {
    "chapter": "Chapter 1",
    "title": "SOVEREIGNTY OF THE PEOPLE AND SUPREMACY OF THIS CONSTITUTION",
    "articles": [
        {
        "number": "1",
        "title": "Sovereignty of the people",
        "content": "1. All sovereign power belongs to the people of Kenya and shall be exercised only in accordance with this Constitution.\n2. The people may exercise their sovereign power either directly or through their democratically elected representatives.\n3. Sovereign power under this Constitution is delegated to the following State organs, which shall perform their functions in accordance with this Constitution:\n   a. Parliament and the legislative assemblies in the county governments;\n   b. the national executive and the executive structures in the county governments; and\n   c. the Judiciary and independent tribunals.\n4. The sovereign power of the people is exercised at:\n   a. the national level; and\n   b. the county level."
        },
        {
        "number": "2",
        "title": "Supremacy of this Constitution",
        "content": "1. This Constitution is the supreme law of the Republic and binds all persons and all State organs at both levels of government.\n2. No person may claim or exercise State authority except as authorised under this Constitution.\n3. The validity or legality of this Constitution is not subject to challenge by or before any court or other State organ.\n4. Any law, including customary law, that is inconsistent with this Constitution is void to the extent of the inconsistency, and any act or omission in contravention of this Constitution is invalid.\n5. The general rules of international law shall form part of the law of Kenya.\n6. Any treaty or convention ratified by Kenya shall form part of the law of Kenya under this Constitution."
        },
        {
        "number": "3",
        "title": "Defence of this Constitution",
        "content": "1. Every person has an obligation to respect, uphold and defend this Constitution.\n2. Any attempt to establish a government otherwise than in compliance with this Constitution is unlawful."
        }
        ]
    },
    {
  "chapter": "Chapter 2",
  "title": "THE REPUBLIC",
  "articles": [
    {
      "number": "4",
      "title": "Declaration of the Republic",
      "content": "1. Kenya is a sovereign Republic.\n2. The Republic of Kenya shall be a multi-party democratic State founded on the national values and principles of governance referred to in Article 10."
    },
    {
      "number": "5",
      "title": "Territory of Kenya",
      "content": "Kenya consists of the territory and territorial waters comprising Kenya on the effective date, and any additional territory and territorial waters as defined by an Act of Parliament."
    },
    {
      "number": "6",
      "title": "Devolution and access to services",
      "content": "1. The territory of Kenya is divided into the counties specified in the First Schedule.\n2. The governments at the national and county levels are distinct and interdependent and shall conduct their mutual relations on the basis of consultation and cooperation.\n3. A national State organ shall ensure reasonable access to its services in all parts of the Republic, so far as it is appropriate to do so having regard to the nature of the service."
    },
    {
      "number": "7",
      "title": "National, official and other languages",
      "content": "1. The national language of the Republic is Kiswahili.\n2. The official languages of the Republic are Kiswahili and English.\n3. The State shall:\n   a. promote and protect the diversity of language of the people of Kenya; and\n   b. promote the development and use of indigenous languages, Kenyan Sign language, Braille and other communication formats and technologies accessible to persons with disabilities."
    },
    {
      "number": "8",
      "title": "State and religion",
      "content": "There shall be no State religion."
    },
    {
      "number": "9",
      "title": "National symbols and national days",
      "content": "1. The national symbols of the Republic are:\n   a. the national flag;\n   b. the national anthem;\n   c. the coat of arms;\n   d. the public seal.\n2. The national symbols are as set out in the Second Schedule.\n3. The national days are:\n   a. Madaraka Day, to be observed on 1st June;\n   b. Mashujaa Day, to be observed on 20th October; and\n   c. Jamhuri Day, to be observed on 12th December.\n4. A national day shall be a public holiday.\n5. Parliament may enact legislation prescribing other public holidays, and providing for observance of public holidays."
    },
    {
      "number": "10",
      "title": "National values and principles of governance",
      "content": "1. The national values and principles of governance in this Article bind all State organs, State officers, public officers and all persons whenever any of them:\n   a. applies or interprets this Constitution;\n   b. enacts, applies or interprets any law; or\n   c. makes or implements public policy decisions.\n2. The national values and principles of governance include:\n   a. patriotism, national unity, sharing and devolution of power, the rule of law, democracy and participation of the people;\n   b. human dignity, equity, social justice, inclusiveness, equality, human rights, non-discrimination and protection of the marginalised;\n   c. good governance, integrity, transparency and accountability; and\n   d. sustainable development."
    },
    {
      "number": "11",
      "title": "Culture",
      "content": "1. This Constitution recognises culture as the foundation of the nation and as the cumulative civilization of the Kenyan people and nation.\n2. The State shall:\n   a. promote all forms of national and cultural expression through literature, the arts, traditional celebrations, science, communication, information, mass media, publications, libraries and other cultural heritage;\n   b. recognise the role of science and indigenous technologies in the development of the nation; and\n   c. promote the intellectual property rights of the people of Kenya.\n3. Parliament shall enact legislation to:\n   a. ensure that communities receive compensation or royalties for the use of their cultures and cultural heritage; and\n   b. recognise and protect the ownership of indigenous seeds and plant varieties, their genetic and diverse characteristics and their use by the communities of Kenya."
        }
    ]
    },
    {
  "chapter": "Chapter 3",
  "title": "CITIZENSHIP",
  "articles": [
    {
      "number": "12",
      "title": "Entitlements of citizens",
      "content": "1. Every citizen is entitled to:\n   a. the rights, privileges and benefits of citizenship, subject to the limits provided or permitted by this Constitution; and\n   b. a Kenyan passport and any document of registration or identification issued by the State to citizens.\n2. A passport or other document referred to in clause (1)(b) may be denied, suspended or confiscated only in accordance with an Act of Parliament that satisfies the criteria mentioned in Article 24."
    },
    {
      "number": "13",
      "title": "Retention and acquisition of citizenship",
      "content": "1. Every person who was a citizen immediately before the effective date retains the same citizenship status as of that date.\n2. Citizenship may be acquired by birth or registration.\n3. Citizenship is not lost through marriage or the dissolution of marriage."
    },
    {
      "number": "14",
      "title": "Citizenship by birth",
      "content": "1. A person is a citizen by birth if on the day of the person's birth, whether or not the person is born in Kenya, either the mother or father of the person is a citizen.\n2. Clause (1) applies equally to a person born before the effective date, whether or not the person was born in Kenya, if either the mother or father of the person is or was a citizen.\n3. Parliament may enact legislation limiting the effect of clauses (1) and (2) on the descendents of Kenyan citizens who are born outside Kenya.\n4. A child found in Kenya who is, or appears to be, less than eight years of age, and whose nationality and parents are not known, is presumed to be a citizen by birth.\n5. A person who is a Kenyan citizen by birth and who, on the effective date, has ceased to be a Kenyan citizen because the person acquired citizenship of another country, is entitled on application to regain Kenyan citizenship."
    },
    {
      "number": "15",
      "title": "Citizenship by registration",
      "content": "1. A person who has been married to a citizen for a period of at least seven years is entitled on application to be registered as a citizen.\n2. A person who has been lawfully resident in Kenya for a continuous period of at least seven years, and who satisfies the conditions prescribed by an Act of Parliament, may apply to be registered as a citizen.\n3. A child who is not a citizen, but is adopted by a citizen, is entitled on application to be registered as a citizen.\n4. Parliament shall enact legislation establishing conditions on which citizenship may be granted to individuals who are citizens of other countries.\n5. This Article applies to a person as from the effective date, but any requirements that must be satisfied before the person is entitled to be registered as a citizen shall be regarded as having been satisfied irrespective of whether the person satisfied them before or after the effective date, or partially before, and partially after, the effective date."
    },
    {
      "number": "16",
      "title": "Dual citizenship",
      "content": "A citizen by birth does not lose citizenship by acquiring the citizenship of another country."
    },
    {
      "number": "17",
      "title": "Revocation of citizenship",
      "content": "1. If a person acquired citizenship by registration, the citizenship may be revoked if the person:\n   a. acquired the citizenship by fraud, false representation or concealment of any material fact;\n   b. has, during any war in which Kenya was engaged, unlawfully traded or communicated with an enemy or been engaged in or associated with any business that was knowingly carried on in such a manner as to assist an enemy in that war;\n   c. has, within five years after registration, been convicted of an offence and sentenced to imprisonment for a term of three years or longer; or\n   d. has, at any time after registration, been convicted of treason, or of an offence for which:\n      i. a penalty of at least seven years imprisonment may be imposed; or\n      ii. a more severe penalty may be imposed.\n2. The citizenship of a person who was presumed to be a citizen by birth, as contemplated in Article 14 (4), may be revoked if:\n   a. the citizenship was acquired by fraud, false representation or concealment of any material fact by any person;\n   b. the nationality or parentage of the person becomes known, and reveals that the person was a citizen of another country; or\n   c. the age of the person becomes known, and reveals that the person was older than eight years when found in Kenya."
    },
    {
      "number": "18",
      "title": "Legislation on citizenship",
      "content": "Parliament shall enact legislation:\n   a. prescribing procedures by which a person may become a citizen;\n   b. governing entry into and residence in Kenya;\n   c. providing for the status of permanent residents;\n   d. providing for voluntary renunciation of citizenship;\n   e. prescribing procedures for revocation of citizenship;\n   f. prescribing the duties and rights of citizens; and\n   g. generally giving effect to the provisions of this Chapter."
        }
    ]
    },
    {
  "chapter": "Chapter 4",
  "title": "THE BILL OF RIGHTS - Part 1: General Provisions",
  "articles": [
    {
      "number": "19",
      "title": "Rights and fundamental freedoms",
      "content": "1. The Bill of Rights is an integral part of Kenya's democratic state and is the framework for social, economic and cultural policies.\n2. The purpose of recognising and protecting human rights and fundamental freedoms is to preserve the dignity of individuals and communities and to promote social justice and the realisation of the potential of all human beings.\n3. The rights and fundamental freedoms in the Bill of Rights:\n   a. belong to each individual and are not granted by the State;\n   b. do not exclude other rights and fundamental freedoms not in the Bill of Rights, but recognised or conferred by law, except to the extent that they are inconsistent with this Chapter; and\n   c. are subject only to the limitations contemplated in this Constitution."
    },
    {
      "number": "20",
      "title": "Application of Bill of Rights",
      "content": "1. The Bill of Rights applies to all law and binds all State organs and all persons.\n2. Every person shall enjoy the rights and fundamental freedoms in the Bill of Rights to the greatest extent consistent with the nature of the right or fundamental freedom.\n3. In applying a provision of the Bill of Rights, a court shall:\n   a. develop the law to the extent that it does not give effect to a right or fundamental freedom; and\n   b. adopt the interpretation that most favours the enforcement of a right or fundamental freedom.\n4. In interpreting the Bill of Rights, a court, tribunal or other authority shall promote:\n   a. the values that underlie an open and democratic society based on human dignity, equality, equity and freedom; and\n   b. the spirit, purport and objects of the Bill of Rights.\n5. In applying any right under Article 43, if the State claims that it does not have the resources to implement the right, a court, tribunal or other authority shall be guided by the following principles:\n   a. it is the responsibility of the State to show that the resources are not available;\n   b. in allocating resources, the State shall give priority to ensuring the widest possible enjoyment of the right or fundamental freedom having regard to prevailing circumstances, including the vulnerability of particular groups or individuals; and\n   c. the court, tribunal or other authority may not interfere with a decision by a State organ concerning the allocation of available resources, solely on the basis that it would have reached a different conclusion."
    },
    {
      "number": "21",
      "title": "Implementation of rights and fundamental freedoms",
      "content": "1. It is a fundamental duty of the State and every State organ to observe, respect, protect, promote and fulfil the rights and fundamental freedoms in the Bill of Rights.\n2. The State shall take legislative, policy and other measures, including the setting of standards, to achieve the progressive realisation of the rights guaranteed under Article 43.\n3. All State organs and all public officers have the duty to address the needs of vulnerable groups within society, including women, older members of society, persons with disabilities, children, youth, members of minority or marginalised communities, and members of particular ethnic, religious or cultural communities.\n4. The State shall enact and implement legislation to fulfil its international obligations in respect of human rights and fundamental freedoms."
    },
    {
      "number": "22",
      "title": "Enforcement of Bill of Rights",
      "content": "1. Every person has the right to institute court proceedings claiming that a right or fundamental freedom in the Bill of Rights has been denied, violated or infringed, or is threatened.\n2. In addition to a person acting in their own interest, court proceedings under clause (1) may be instituted by:\n   a. a person acting on behalf of another person who cannot act in their own name;\n   b. a person acting as a member of, or in the interest of, a group or class of persons;\n   c. a person acting in the public interest; or\n   d. an association acting in the interest of one or more of its members.\n3. The Chief Justice shall make rules providing for the court proceedings referred to in this Article, which shall satisfy the criteria that:\n   a. the rights of standing provided for in clause (2) are fully facilitated;\n   b. formalities relating to the proceedings, including commencement of the proceedings, are kept to the minimum, and in particular that the court shall, if necessary, entertain proceedings on the basis of informal documentation;\n   c. no fee may be charged for commencing the proceedings;\n   d. the court, while observing the rules of natural justice, shall not be unreasonably restricted by procedural technicalities; and\n   e. an organisation or individual with particular expertise may, with the leave of the court, appear as a friend of the court.\n4. The absence of rules contemplated in clause (3) does not limit the right of any person to commence court proceedings under this Article, and to have the matter heard and determined by a court."
    },
    {
      "number": "23",
      "title": "Authority of courts to uphold and enforce the Bill of Rights",
      "content": "1. The High Court has jurisdiction, in accordance with Article 165, to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights.\n2. Parliament shall enact legislation to give original jurisdiction in appropriate cases to subordinate courts to hear and determine applications for redress of a denial, violation or infringement of, or threat to, a right or fundamental freedom in the Bill of Rights.\n3. In any proceedings brought under Article 22, a court may grant appropriate relief, including:\n   a. a declaration of rights;\n   b. an injunction;\n   c. a conservatory order;\n   d. a declaration of invalidity of any law that denies, violates, infringes, or threatens a right or fundamental freedom in the Bill of Rights and is not justified under Article 24;\n   e. an order for compensation; and\n   f. an order of judicial review."
    },
    {
      "number": "24",
      "title": "Limitation of rights and fundamental freedoms",
      "content": "1. A right or fundamental freedom in the Bill of Rights shall not be limited except by law, and then only to the extent that the limitation is reasonable and justifiable in an open and democratic society based on human dignity, equality and freedom, taking into account all relevant factors, including:\n   a. the nature of the right or fundamental freedom;\n   b. the importance of the purpose of the limitation;\n   c. the nature and extent of the limitation;\n   d. the need to ensure that the enjoyment of rights and fundamental freedoms by any individual does not prejudice the rights and fundamental freedoms of others; and\n   e. the relation between the limitation and its purpose and whether there are less restrictive means to achieve the purpose.\n2. Despite clause (1), a provision in legislation limiting a right or fundamental freedom:\n   a. in the case of a provision enacted or amended on or after the effective date, is not valid unless the legislation specifically expresses the intention to limit that right or fundamental freedom, and the nature and extent of the limitation;\n   b. shall not be construed as limiting the right or fundamental freedom unless the provision is clear and specific about the right or freedom to be limited and the nature and extent of the limitation; and\n   c. shall not limit the right or fundamental freedom so far as to derogate from its core or essential content.\n3. The State or a person seeking to justify a particular limitation shall demonstrate to the court, tribunal or other authority that the requirements of this Article have been satisfied.\n4. The provisions of this Chapter on equality shall be qualified to the extent strictly necessary for the application of Muslim law before the Kadhis' courts, to persons who profess the Muslim religion, in matters relating to personal status, marriage, divorce and inheritance.\n5. Despite clause (1) and (2), a provision in legislation may limit the application of the rights or fundamental freedoms in the following provisions to persons serving in the Kenya Defence Forces or the National Police Service:\n   a. Article 31 - Privacy;\n   b. Article 36 - Freedom of association;\n   c. Article 37 - Assembly, demonstration, picketing and petition;\n   d. Article 41 - Labour relations;\n   e. Article 43 - Economic and social rights; and\n   f. Article 49 - Rights of arrested persons."
    },
    {
      "number": "25",
      "title": "Fundamental Rights and freedoms that may not be limited",
      "content": "Despite any other provision in this Constitution, the following rights and fundamental freedoms shall not be limited:\n   a. freedom from torture and cruel, inhuman or degrading treatment or punishment;\n   b. freedom from slavery or servitude;\n   c. the right to a fair trial; and\n   d. the right to an order of habeas corpus."
        }

        ]
    
    },
        {
  "chapter": "Chapter 4",
  "title": "THE BILL OF RIGHTS - Part 2: Rights and Fundamental Freedoms",
  "articles": [
    {
      "number": "26",
      "title": "Right to life",
      "content": "1. Every person has the right to life.\n2. The life of a person begins at conception.\n3. A person shall not be deprived of life intentionally, except to the extent authorised by this Constitution or other written law.\n4. Abortion is not permitted unless, in the opinion of a trained health professional, there is need for emergency treatment, or the life or health of the mother is in danger, or if permitted by any other written law."
    },
    {
      "number": "27",
      "title": "Equality and freedom from discrimination",
      "content": "1. Every person is equal before the law and has the right to equal protection and equal benefit of the law.\n2. Equality includes the full and equal enjoyment of all rights and fundamental freedoms.\n3. Women and men have the right to equal treatment, including the right to equal opportunities in political, economic, cultural and social spheres.\n4. The State shall not discriminate directly or indirectly against any person on any ground, including race, sex, pregnancy, marital status, health status, ethnic or social origin, colour, age, disability, religion, conscience, belief, culture, dress, language or birth.\n5. A person shall not discriminate directly or indirectly against another person on any of the grounds specified or contemplated in clause (4).\n6. To give full effect to the realisation of the rights guaranteed under this Article, the State shall take legislative and other measures, including affirmative action programmes and policies designed to redress any disadvantage suffered by individuals or groups because of past discrimination.\n7. Any measure taken under clause (6) shall adequately provide for any benefits to be on the basis of genuine need.\n8. In addition to the measures contemplated in clause (6), the State shall take legislative and other measures to implement the principle that not more than two-thirds of the members of elective or appointive bodies shall be of the same gender."
    },
    {
      "number": "28",
      "title": "Human dignity",
      "content": "Every person has inherent dignity and the right to have that dignity respected and protected."
    },
    {
      "number": "29",
      "title": "Freedom and security of the person",
      "content": "Every person has the right to freedom and security of the person, which includes the right not to be:\n   a. deprived of freedom arbitrarily or without just cause;\n   b. detained without trial, except during a state of emergency, in which case the detention is subject to Article 58;\n   c. subjected to any form of violence from either public or private sources;\n   d. subjected to torture in any manner, whether physical or psychological;\n   e. subjected to corporal punishment; or\n   f. treated or punished in a cruel, inhuman or degrading manner."
    },
    {
      "number": "30",
      "title": "Slavery, servitude and forced labour",
      "content": "1. A person shall not be held in slavery or servitude.\n2. A person shall not be required to perform forced labour."
    },
    {
      "number": "31",
      "title": "Privacy",
      "content": "Every person has the right to privacy, which includes the right not to have:\n   a. their person, home or property searched;\n   b. their possessions seized;\n   c. information relating to their family or private affairs unnecessarily required or revealed; or\n   d. the privacy of their communications infringed."
    },
    {
      "number": "32",
      "title": "Freedom of conscience, religion, belief and opinion",
      "content": "1. Every person has the right to freedom of conscience, religion, thought, belief and opinion.\n2. Every person has the right, either individually or in community with others, in public or in private, to manifest any religion or belief through worship, practice, teaching or observance, including observance of a day of worship.\n3. A person may not be denied access to any institution, employment or facility, or the enjoyment of any right, because of the person's belief or religion.\n4. A person shall not be compelled to act, or engage in any act, that is contrary to the person's belief or religion."
    },
    {
      "number": "33",
      "title": "Freedom of expression",
      "content": "1. Every person has the right to freedom of expression, which includes:\n   a. freedom to seek, receive or impart information or ideas;\n   b. freedom of artistic creativity; and\n   c. academic freedom and freedom of scientific research.\n2. The right to freedom of expression does not extend to:\n   a. propaganda for war;\n   b. incitement to violence;\n   c. hate speech; or\n   d. advocacy of hatred that:\n      i. constitutes ethnic incitement, vilification of others or incitement to cause harm; or\n      ii. is based on any ground of discrimination specified or contemplated in Article 27 (4).\n3. In the exercise of the right to freedom of expression, every person shall respect the rights and reputation of others."
    },
    {
      "number": "34",
      "title": "Freedom of the media",
      "content": "1. Freedom and independence of electronic, print and all other types of media is guaranteed, but does not extend to any expression specified in Article 33 (2).\n2. The State shall not:\n   a. exercise control over or interfere with any person engaged in broadcasting, the production or circulation of any publication or the dissemination of information by any medium; or\n   b. penalise any person for any opinion or view or the content of any broadcast, publication or dissemination.\n3. Broadcasting and other electronic media have freedom of establishment, subject only to licensing procedures that:\n   a. are necessary to regulate the airwaves and other forms of signal distribution; and\n   b. are independent of control by government, political interests or commercial interests.\n4. All State-owned media shall:\n   a. be free to determine independently the editorial content of their broadcasts or other communications;\n   b. be impartial; and\n   c. afford fair opportunity for the presentation of divergent views and dissenting opinions.\n5. Parliament shall enact legislation that provides for the establishment of a body, which shall:\n   a. be independent of control by government, political interests or commercial interests;\n   b. reflect the interests of all sections of the society; and\n   c. set media standards and regulate and monitor compliance with those standards."
    },
    {
      "number": "35",
      "title": "Access to information",
      "content": "1. Every citizen has the right of access to:\n   a. information held by the State; and\n   b. information held by another person and required for the exercise or protection of any right or fundamental freedom.\n2. Every person has the right to the correction or deletion of untrue or misleading information that affects the person.\n3. The State shall publish and publicise any important information affecting the nation."
        }
    ]
    },
    {
  "chapter": "Chapter 4",
  "title": "THE BILL OF RIGHTS - Part 3: Specific Application of Rights",
  "articles": [
    {
      "number": "52",
      "title": "Interpretation of this Part",
      "content": "1. This Part elaborates certain rights to ensure greater certainty as to the application of those rights and fundamental freedoms to certain groups of persons.\n2. This Part shall not be construed as limiting or qualifying any right."
    },
    {
      "number": "53",
      "title": "Children",
      "content": "1. Every child has the right:\n   a. to a name and nationality from birth;\n   b. to free and compulsory basic education;\n   c. to basic nutrition, shelter and health care;\n   d. to be protected from abuse, neglect, harmful cultural practices, all forms of violence, inhuman treatment and punishment, and hazardous or exploitative labour;\n   e. to parental care and protection, which includes equal responsibility of the mother and father to provide for the child, whether they are married to each other or not; and\n   f. not to be detained, except as a measure of last resort, and when detained, to be held:\n      i. for the shortest appropriate period of time; and\n      ii. separate from adults and in conditions that take account of the child's sex and age.\n2. A child's best interests are of paramount importance in every matter concerning the child."
    },
    {
      "number": "54",
      "title": "Persons with disabilities",
      "content": "1. A person with any disability is entitled:\n   a. to be treated with dignity and respect and to be addressed and referred to in a manner that is not demeaning;\n   b. to access educational institutions and facilities for persons with disabilities that are integrated into society to the extent compatible with the interests of the person;\n   c. to reasonable access to all places, public transport and information;\n   d. to use Sign language, Braille or other appropriate means of communication; and\n   e. to access materials and devices to overcome constraints arising from the person's disability.\n2. The State shall ensure the progressive implementation of the principle that at least five percent of the members of the public in elective and appointive bodies are persons with disabilities."
    },
    {
      "number": "55",
      "title": "Youth",
      "content": "The State shall take measures, including affirmative action programmes, to ensure that the youth:\n   a. access relevant education and training;\n   b. have opportunities to associate, be represented and participate in political, social, economic and other spheres of life;\n   c. access employment; and\n   d. are protected from harmful cultural practices and exploitation."
    },
    {
      "number": "56",
      "title": "Minorities and marginalised groups",
      "content": "The State shall put in place affirmative action programmes designed to ensure that minorities and marginalised groups:\n   a. participate and are represented in governance and other spheres of life;\n   b. are provided special opportunities in educational and economic fields;\n   c. are provided special opportunities for access to employment;\n   d. develop their cultural values, languages and practices; and\n   e. have reasonable access to water, health services and infrastructure."
    },
    {
      "number": "57",
      "title": "Older members of society",
      "content": "The State shall take measures to ensure the rights of older persons:\n   a. to fully participate in the affairs of society;\n   b. to pursue their personal development;\n   c. to live in dignity and respect and be free from abuse; and\n   d. to receive reasonable care and assistance from their family and the State."
        }
    ]
    },
    {
  "chapter": "Chapter 4",
  "title": "THE BILL OF RIGHTS - Part 4: State of Emergency",
  "articles": [
    {
      "number": "58",
      "title": "State of emergency",
      "content": "1. A state of emergency may be declared only under Article 132 (4)(d) and only when:\n   a. the State is threatened by war, invasion, general insurrection, disorder, natural disaster or other public emergency; and\n   b. the declaration is necessary to meet the circumstances for which the emergency is declared.\n2. A declaration of a state of emergency, and any legislation enacted or other action taken in consequence of the declaration, shall be effective only:\n   a. prospectively; and\n   b. for not longer than fourteen days from the date of the declaration, unless the National Assembly resolves to extend the declaration.\n3. The National Assembly may extend a declaration of a state of emergency:\n   a. by resolution adopted:\n      i. following a public debate in the National Assembly; and\n      ii. by the majorities specified in clause (4); and\n   b. for not longer than two months at a time.\n4. The first extension of the declaration of a state of emergency requires a supporting vote of at least two-thirds of all the members of the National Assembly, and any subsequent extension requires a supporting vote of at least three-quarters of all the members of the National Assembly.\n5. The Supreme Court may decide on the validity of:\n   a. a declaration of a state of emergency;\n   b. any extension of a declaration of a state of emergency; and\n   c. any legislation enacted, or other action taken, in consequence of a declaration of a state of emergency.\n6. Any legislation enacted in consequence of a declaration of a state of emergency:\n   a. may limit a right or fundamental freedom in the Bill of Rights only to the extent that:\n      i. the limitation is strictly required by the emergency; and\n      ii. the legislation is consistent with the Republic's obligations under international law applicable to a state of emergency; and\n   b. shall not take effect until it is published in the Gazette.\n7. A declaration of a state of emergency, or legislation enacted or other action taken in consequence of any declaration, may not permit or authorise the indemnification of the State, or of any person, in respect of any unlawful act or omission."
        }
    ]
    },
    {
  "chapter": "Chapter 4",
  "title": "THE BILL OF RIGHTS - Part 5: Kenya National Human Rights and Equality Commission",
  "articles": [
    {
      "number": "59",
      "title": "Kenya National Human Rights and Equality Commission",
      "content": "1. There is established the Kenya National Human Rights and Equality Commission.\n2. The functions of the Commission are:\n   a. to promote respect for human rights and develop a culture of human rights in the Republic;\n   b. to promote gender equality and equity generally and to coordinate and facilitate gender mainstreaming in national development;\n   c. to promote the protection, and observance of human rights in public and private institutions;\n   d. to monitor, investigate and report on the observance of human rights in all spheres of life in the Republic, including observance by the national security organs;\n   e. to receive and investigate complaints about alleged abuses of human rights and take steps to secure appropriate redress where human rights have been violated;\n   f. on its own initiative or on the basis of complaints, to investigate or research a matter in respect of human rights, and make recommendations to improve the functioning of State organs;\n   g. to act as the principal organ of the State in ensuring compliance with obligations under treaties and conventions relating to human rights;\n   h. to investigate any conduct in state affairs, or any act or omission in public administration in any sphere of government, that is alleged or suspected to be prejudicial or improper or to result in any impropriety or prejudice;\n   i. to investigate complaints of abuse of power, unfair treatment, manifest injustice or unlawful, oppressive, unfair or unresponsive official conduct;\n   j. to report on complaints investigated under paragraphs (h) and (i) and take remedial action; and\n   k. to perform any other functions prescribed by legislation.\n3. Every person has the right to complain to the Commission, alleging that a right or fundamental freedom in the Bill of Rights has been denied, violated or infringed, or is threatened.\n4. Parliament shall enact legislation to give full effect to this Part, and any such legislation may restructure the Commission into two or more separate commissions.\n5. If Parliament enacts legislation restructuring the Commission under clause (4):\n   a. that legislation shall assign each function of the Commission mentioned in this Article to one or the other of the successor commissions;\n   b. each of the successor commissions shall have powers equivalent to the powers of the Commission under this Article; and\n   c. each successor commission shall be a commission within the meaning of Chapter Fifteen, and shall have the status and powers of a commission under that Chapter."
        }
    ]
    },
    {
  "chapter": "Chapter 5",
  "title": "LAND AND ENVIRONMENT - Part 1: Land",
  "articles": [
    {
      "number": "60",
      "title": "Principles of land policy",
      "content": "1. Land in Kenya shall be held, used and managed in a manner that is equitable, efficient, productive and sustainable, and in accordance with the following principles:\n   a. equitable access to land;\n   b. security of land rights;\n   c. sustainable and productive management of land resources;\n   d. transparent and cost effective administration of land;\n   e. sound conservation and protection of ecologically sensitive areas;\n   f. elimination of gender discrimination in law, customs and practices related to land and property in land; and\n   g. encouragement of communities to settle land disputes through recognised local community initiatives consistent with this Constitution.\n2. These principles shall be implemented through a national land policy developed and reviewed regularly by the national government and through legislation."
    },
    {
      "number": "61",
      "title": "Classification of land",
      "content": "1. All land in Kenya belongs to the people of Kenya collectively as a nation, as communities and as individuals.\n2. Land in Kenya is classified as public, community or private."
    },
    {
      "number": "62",
      "title": "Public land",
      "content": "1. Public land is:\n   a. land which at the effective date was unalienated government land;\n   b. land lawfully held, used or occupied by any State organ, except such land that is occupied as lessee under a private lease;\n   c. land transferred to the State by way of sale, reversion or surrender;\n   d. land in respect of which no individual or community ownership can be established by any legal process;\n   e. land in respect of which no heir can be identified by any legal process;\n   f. all minerals and mineral oils as defined by law;\n   g. government forests (excluding Article 63 (2) (d) (i)), game reserves, water catchment areas, national parks, animal sanctuaries, and specially protected areas;\n   h. all roads and thoroughfares provided for by an Act of Parliament;\n   i. all rivers, lakes and other water bodies as defined by an Act of Parliament;\n   j. the territorial sea, exclusive economic zone and seabed;\n   k. the continental shelf;\n   l. all land between the high and low water marks;\n   m. any land not classified as private or community land;\n   n. any other land declared to be public land by an Act of Parliament.\n2. Public land shall vest in and be held by a county government in trust for the people resident in the county, and administered by the National Land Commission if classified under:\n   a. clause (1)(a), (c), (d) or (e); and\n   b. clause (1)(b), excluding land held, used or occupied by a national State organ.\n3. Land under clause (1)(f) to (m) vests in and is held by the national government in trust for the people of Kenya and administered by the National Land Commission.\n4. Public land shall not be disposed of or otherwise used except by terms set in an Act of Parliament."
    },
    {
      "number": "63",
      "title": "Community land",
      "content": "1. Community land shall vest in and be held by communities identified by ethnicity, culture or similar community of interest.\n2. Community land consists of:\n   a. land lawfully registered in the name of group representatives;\n   b. land lawfully transferred to a specific community;\n   c. land declared as community land by an Act of Parliament;\n   d. land that is:\n      i. lawfully held, managed or used as community forests, grazing areas or shrines;\n      ii. ancestral lands or lands traditionally occupied by hunter-gatherer communities;\n      iii. lawfully held as trust land by county governments.\n3. Unregistered community land shall be held in trust by county governments on behalf of the communities.\n4. Community land shall not be disposed of or used except by legislation specifying the rights of members.\n5. Parliament shall enact legislation to give effect to this Article."
    },
    {
      "number": "64",
      "title": "Private land",
      "content": "Private land consists of:\n   a. registered land held by any person under freehold tenure;\n   b. land held under leasehold tenure;\n   c. land declared private under an Act of Parliament."
    },
    {
      "number": "65",
      "title": "Landholding by non-citizens",
      "content": "1. A non-citizen may hold land on leasehold only, and not exceeding 99 years.\n2. Any document granting more than 99 years to a non-citizen is deemed to confer only a 99-year leasehold.\n3. For this Article:\n   a. a body corporate is a citizen only if wholly owned by citizens;\n   b. trust property is considered held by a citizen only if the beneficial interest is held by citizens.\n4. Parliament may legislate further provisions."
    },
    {
      "number": "66",
      "title": "Regulation of land use and property",
      "content": "1. The State may regulate land use in the interest of defence, safety, public order, morality, health, or planning.\n2. Parliament shall ensure property investments benefit local communities and economies."
    },
    {
      "number": "67",
      "title": "National Land Commission",
      "content": "1. The National Land Commission is established.\n2. Its functions are:\n   a. manage public land on behalf of national and county governments;\n   b. recommend national land policy;\n   c. advise on land title registration nationwide;\n   d. conduct research on land and resource use and recommend action;\n   e. investigate land injustices and recommend redress;\n   f. encourage traditional dispute resolution in land matters;\n   g. assess land tax and immovable property premiums;\n   h. monitor land use planning.\n3. The Commission may perform other functions set by legislation."
    },
    {
      "number": "68",
      "title": "Legislation on land",
      "content": "Parliament shall:\n   a. revise, consolidate and rationalise land laws;\n   b. revise land use laws in line with Article 60(1);\n   c. enact laws:\n      i. on minimum/maximum landholding sizes for private land;\n      ii. on changing land categories;\n      iii. to protect matrimonial property, especially the matrimonial home;\n      iv. to preserve and enable access to public land;\n      v. to review all grants/dispositions of public land for legality;\n      vi. to protect dependants of deceased persons with land interests;\n      vii. on any other matter for implementing this Chapter."
        }
    ]
    },
    {
  "chapter": "Chapter 5",
  "title": "LAND AND ENVIRONMENT - Part 2: Environment and Natural Resources",
  "articles": [
    {
      "number": "69",
      "title": "Obligations in respect of the environment",
      "content": "1. The State shall:\n   a. ensure sustainable exploitation, utilisation, management and conservation of the environment and natural resources, and ensure the equitable sharing of the accruing benefits;\n   b. work to achieve and maintain a tree cover of at least ten per cent of the land area of Kenya;\n   c. protect and enhance intellectual property in, and indigenous knowledge of, biodiversity and the genetic resources of the communities;\n   d. encourage public participation in the management, protection and conservation of the environment;\n   e. protect genetic resources and biological diversity;\n   f. establish systems of environmental impact assessment, environmental audit and monitoring of the environment;\n   g. eliminate processes and activities that are likely to endanger the environment; and\n   h. utilise the environment and natural resources for the benefit of the people of Kenya.\n2. Every person has a duty to cooperate with State organs and other persons to protect and conserve the environment and ensure ecologically sustainable development and use of natural resources."
    },
    {
      "number": "70",
      "title": "Enforcement of environmental rights",
      "content": "1. If a person alleges that a right to a clean and healthy environment recognised and protected under Article 42 has been, is being or is likely to be, denied, violated, infringed or threatened, the person may apply to a court for redress in addition to any other legal remedies that are available in respect to the same matter.\n2. On application under clause (1), the court may make any order, or give any directions, it considers appropriate:\n   a. to prevent, stop or discontinue any act or omission that is harmful to the environment;\n   b. to compel any public officer to take measures to prevent or discontinue any act or omission that is harmful to the environment; or\n   c. to provide compensation for any victim of a violation of the right to a clean and healthy environment.\n3. For the purposes of this Article, an applicant does not have to demonstrate that any person has incurred loss or suffered injury."
    },
    {
      "number": "71",
      "title": "Agreements relating to natural resources",
      "content": "1. A transaction is subject to ratification by Parliament if it:\n   a. involves the grant of a right or concession by or on behalf of any person, including the national government, to another person for the exploitation of any natural resource of Kenya; and\n   b. is entered into on or after the effective date.\n2. Parliament shall enact legislation providing for the classes of transactions subject to ratification under clause (1)."
    },
    {
      "number": "72",
      "title": "Legislation relating to the environment",
      "content": "Parliament shall enact legislation to give full effect to the provisions of this Part."
        }
    ]
    },
    {
  "chapter": "Chapter 6",
  "title": "LEADERSHIP AND INTEGRITY",
  "articles": [
    {
      "number": "73",
      "title": "Responsibilities of leadership",
      "content": "1. Authority assigned to a State officer:\n   a. is a public trust to be exercised in a manner that:\n      i. is consistent with the purposes and objects of this Constitution;\n      ii. demonstrates respect for the people;\n      iii. brings honour to the nation and dignity to the office; and\n      iv. promotes public confidence in the integrity of the office; and\n   b. vests in the State officer the responsibility to serve the people, rather than the power to rule them.\n2. The guiding principles of leadership and integrity include:\n   a. selection on the basis of personal integrity, competence and suitability, or election in free and fair elections;\n   b. objectivity and impartiality in decision making, and in ensuring that decisions are not influenced by nepotism, favouritism, other improper motives or corrupt practices;\n   c. selfless service based solely on the public interest, demonstrated by:\n      i. honesty in the execution of public duties; and\n      ii. the declaration of any personal interest that may conflict with public duties;\n   d. accountability to the public for decisions and actions; and\n   e. discipline and commitment in service to the people."
    },
    {
      "number": "74",
      "title": "Oath of office of State officers",
      "content": "Before assuming a State office, acting in a State office, or performing any functions of a State office, a person shall take and subscribe the oath or affirmation of office, in the manner and form prescribed by the Third Schedule or under an Act of Parliament."
    },
    {
      "number": "75",
      "title": "Conduct of State officers",
      "content": "1. A State officer shall behave, whether in public and official life, in private life, or in association with other persons, in a manner that avoids:\n   a. any conflict between personal interests and public or official duties;\n   b. compromising any public or official interest in favour of a personal interest; or\n   c. demeaning the office the officer holds.\n2. A person who contravenes clause (1), or Article 76, 77 or 78 (2):\n   a. shall be subject to the applicable disciplinary procedure for the relevant office; and\n   b. may, in accordance with the disciplinary procedure referred to in paragraph (a), be dismissed or otherwise removed from office.\n3. A person who has been dismissed or otherwise removed from office for a contravention of the provisions mentioned in clause (2) is disqualified from holding any other State office."
    },
    {
      "number": "76",
      "title": "Financial probity of State officers",
      "content": "1. A gift or donation to a State officer on a public or official occasion is a gift or donation to the Republic and shall be delivered to the State unless exempted under an Act of Parliament.\n2. A State officer shall not:\n   a. maintain a bank account outside Kenya except in accordance with an Act of Parliament; or\n   b. seek or accept a personal loan or benefit in circumstances that compromise the integrity of the State officer."
    },
    {
      "number": "77",
      "title": "Restriction on activities of State officers",
      "content": "1. A full-time State officer shall not participate in any other gainful employment.\n2. Any appointed State officer shall not hold office in a political party.\n3. A retired State officer who is receiving a pension from public funds shall not hold more than two concurrent remunerative positions as chairperson, director or employee of:\n   a. a company owned or controlled by the State; or\n   b. a State organ.\n4. A retired State officer shall not receive remuneration from public funds other than as contemplated in clause (3)."
    },
    {
      "number": "78",
      "title": "Citizenship and leadership",
      "content": "1. A person is not eligible for election or appointment to a State office unless the person is a citizen of Kenya.\n2. A State officer or a member of the defence forces shall not hold dual citizenship.\n3. Clauses (1) and (2) do not apply to:\n   a. judges and members of commissions; or\n   b. any person who has been made a citizen of another country by operation of that country's law, without ability to opt out."
    },
    {
      "number": "79",
      "title": "Legislation to establish the ethics and anti-corruption commission",
      "content": "Parliament shall enact legislation to establish an independent ethics and anti-corruption commission, which shall be and have the status and powers of a commission under Chapter Fifteen, for purposes of ensuring compliance with, and enforcement of, the provisions of this Chapter."
    },
    {
      "number": "80",
      "title": "Legislation on leadership",
      "content": "Parliament shall enact legislation:\n   a. establishing procedures and mechanisms for the effective administration of this Chapter;\n   b. prescribing the penalties, in addition to the penalties referred to in Article 75, that may be imposed for a contravention of this Chapter;\n   c. providing for the application of this Chapter, with the necessary modifications, to public officers; and\n   d. making any other provision necessary for ensuring the promotion of the principles of leadership and integrity mentioned in this Chapter, and the enforcement of this Chapter."
        }
    ]
    },
    {
  "chapter": "Chapter 7",
  "title": "REPRESENTATION OF THE PEOPLE - Part 1: Electoral System and Process",
  "articles": [
    {
      "number": "81",
      "title": "General principles for the electoral system",
      "content": "The electoral system shall comply with the following principles:\n   a. freedom of citizens to exercise their political rights under Article 38;\n   b. not more than two-thirds of the members of elective public bodies shall be of the same gender;\n   c. fair representation of persons with disabilities;\n   d. universal suffrage based on the aspiration for fair representation and equality of vote; and\n   e. free and fair elections, which are:\n      i. by secret ballot;\n      ii. free from violence, intimidation, improper influence or corruption;\n      iii. conducted by an independent body;\n      iv. transparent; and\n      v. administered in an impartial, neutral, efficient, accurate and accountable manner."
    },
    {
      "number": "82",
      "title": "Legislation on elections",
      "content": "1. Parliament shall enact legislation to provide for:\n   a. the delimitation by the Independent Electoral and Boundaries Commission of electoral units for election of members of the National Assembly and county assemblies;\n   b. the nomination of candidates;\n   c. the continuous registration of citizens as voters;\n   d. the conduct of elections and referenda and the regulation and efficient supervision of elections and referenda, including the nomination of candidates for elections; and\n   e. the progressive registration of citizens residing outside Kenya, and the progressive realisation of their right to vote.\n2. Legislation required by clause (1)(d) shall ensure that voting at every election is:\n   a. simple;\n   b. transparent; and\n   c. takes into account the special needs of:\n      i. persons with disabilities; and\n      ii. other persons or groups with special needs."
    },
    {
      "number": "83",
      "title": "Registration as a voter",
      "content": "1. A person qualifies for registration as a voter at elections or referenda if the person:\n   a. is an adult citizen;\n   b. is not declared to be of unsound mind; and\n   c. has not been convicted of an election offence during the preceding five years.\n2. A citizen who qualifies for registration as a voter shall be registered at only one registration centre.\n3. Administrative arrangements for the registration of voters and the conduct of elections shall be designed to facilitate, and shall not deny, an eligible citizen the right to vote or stand for election."
    },
    {
      "number": "84",
      "title": "Candidates for election and political parties to comply with code of conduct",
      "content": "In every election, all candidates and all political parties shall comply with the code of conduct prescribed by the Independent Electoral and Boundaries Commission."
    },
    {
      "number": "85",
      "title": "Eligibility to stand as an independent candidate",
      "content": "Any person is eligible to stand as an independent candidate for election if the person:\n   a. is not a member of a registered political party and has not been a member for at least three months immediately before the date of the election; and\n   b. satisfies the requirements of:\n      i. Article 99(1)(c)(i) or (ii), in the case of a candidate for election to the National Assembly or the Senate, respectively; or\n      ii. Article 193(1)(c)(ii), in the case of a candidate for election to a county assembly."
    },
    {
      "number": "86",
      "title": "Voting",
      "content": "At every election, the Independent Electoral and Boundaries Commission shall ensure that:\n   a. whatever voting method is used, the system is simple, accurate, verifiable, secure, accountable and transparent;\n   b. the votes cast are counted, tabulated and the results announced promptly by the presiding officer at each polling station;\n   c. the results from the polling stations are openly and accurately collated and promptly announced by the returning officer; and\n   d. appropriate structures and mechanisms to eliminate electoral malpractice are put in place, including the safekeeping of election materials."
    },
    {
      "number": "87",
      "title": "Electoral disputes",
      "content": "1. Parliament shall enact legislation to establish mechanisms for timely settling of electoral disputes.\n2. Petitions concerning an election, other than a presidential election, shall be filed within twenty-eight days after the declaration of the election results by the Independent Electoral and Boundaries Commission.\n3. Service of a petition may be direct or by advertisement in a newspaper with national circulation."
      },
      {
  "chapter": "Chapter 7",
  "title": "REPRESENTATION OF THE PEOPLE - Part 2: Independent Electoral and Boundaries Commission and Delimitation of Electoral Units",
  "articles": [
    {
      "number": "88",
      "title": "Independent Electoral and Boundaries Commission",
      "content": "1. There is established the Independent Electoral and Boundaries Commission.\n\n2. A person is not eligible for appointment as a member of the Commission if the person:\n   a. has, at any time within the preceding five years, held office, or stood for election as:\n      i. a member of Parliament or of a county assembly; or\n      ii. a member of the governing body of a political party; or\n   b. holds any State office.\n\n3. A member of the Commission shall not hold another public office.\n\n4. The Commission is responsible for conducting or supervising referenda and elections to any elective body or office established by this Constitution, and any other elections as prescribed by an Act of Parliament, including:\n   a. the continuous registration of citizens as voters;\n   b. the regular revision of the voters' roll;\n   c. the delimitation of constituencies and wards;\n   d. the regulation of the process by which parties nominate candidates for elections;\n   e. the settlement of electoral disputes, including disputes relating to or arising from nominations but excluding election petitions and disputes subsequent to the declaration of election results;\n   f. the registration of candidates for election;\n   g. voter education;\n   h. the facilitation of the observation, monitoring and evaluation of elections;\n   i. the regulation of the amount of money that may be spent by or on behalf of a candidate or party in respect of any election;\n   j. the development of a code of conduct for candidates and parties contesting elections; and\n   k. the monitoring of compliance with the legislation required by Article 82(1)(b) relating to nomination of candidates by parties.\n\n5. The Commission shall exercise its powers and perform its functions in accordance with this Constitution and national legislation."
    },
    {
      "number": "89",
      "title": "Delimitation of electoral units",
      "content": "1. There shall be two hundred and ninety constituencies for the purposes of the election of the members of the National Assembly provided for in Article 97(1)(a).\n\n2. The Independent Electoral and Boundaries Commission shall review the names and boundaries of constituencies at intervals of not less than eight years and not more than twelve years, but any review shall be completed at least twelve months before a general election of members of Parliament.\n\n3. The Commission shall review the number, names and boundaries of wards periodically.\n\n4. If a general election is to be held within twelve months after the completion of a review by the Commission, the new boundaries shall not take effect for purposes of that election.\n\n5. The boundaries of each constituency shall be such that the number of inhabitants in the constituency is, as nearly as possible, equal to the population quota, but the number of inhabitants of a constituency may be greater or lesser than the population quota in order to take account of:\n   a. geographical features and urban centres;\n   b. community of interest, historical, economic and cultural ties; and\n   c. means of communication.\n\n6. The number of inhabitants of a constituency or ward may be greater or lesser than the population quota by a margin of not more than:\n   a. forty per cent for cities and sparsely populated areas; and\n   b. thirty per cent for the other areas.\n\n7. In reviewing constituency and ward boundaries the Commission shall:\n   a. consult all interested parties; and\n   b. progressively work towards ensuring that the number of inhabitants in each constituency and ward is, as nearly as possible, equal to the population quota.\n\n8. If necessary, the Commission shall alter the names and boundaries of constituencies, and the number, names and boundaries of wards.\n\n9. Subject to clauses (1), (2), (3) and (4), the names and details of the boundaries of constituencies and wards determined by the Commission shall be published in the Gazette, and shall come into effect on the dissolution of Parliament first following their publication.\n\n10. A person may apply to the High Court for review of a decision of the Commission made under this Article.\n\n11. An application for the review of a decision made under this Article shall be filed within thirty days of the publication of the decision in the Gazette and shall be heard and determined within three months of the date on which it is filed.\n\n12. For the purposes of this Article, \"population quota\" means the number obtained by dividing the number of inhabitants of Kenya by the number of constituencies or wards, as applicable, into which Kenya is divided under this Article."
        },
      {
      "number": "90",
      "title": "Allocation of party list seats",
      "content": "1. Elections for the seats in Parliament provided for under Articles 97(1)(c) and 98(1)(b), (c) and (d), and for the members of county assemblies under Article 177(1)(b) and (c), shall be on the basis of proportional representation by use of party lists.\n\n2. The Independent Electoral and Boundaries Commission shall be responsible for the conduct and supervision of elections for seats provided for under clause (1) and shall ensure that:\n   a. each political party participating in a general election nominates and submits a list of all the persons who would stand elected if the party were to be entitled to all the seats provided for under clause (1), within the time prescribed by national legislation;\n   b. except in the case of the seats provided for under Article 98(1)(b), each party list comprises the appropriate number of qualified candidates and alternates between male and female candidates in the priority in which they are listed; and\n   c. except in the case of county assembly seats, each party list reflects the regional and ethnic diversity of the people of Kenya.\n\n3. The seats mentioned in clause (1) shall be allocated to political parties in proportion to the total number of seats won by candidates of the political party at the general election."
    }
      ]
    },
    {
  "chapter": "Chapter 7",
  "title": "REPRESENTATION OF THE PEOPLE - Part 3: Political Parties",
  "articles": [
    {
      "number": "91",
      "title": "Basic requirements for political parties",
      "content": "1. Every political party shall:\n   a. have a national character as prescribed by an Act of Parliament;\n   b. have a democratically elected governing body;\n   c. promote and uphold national unity;\n   d. abide by the democratic principles of good governance, promote and practise democracy through regular, fair and free elections within the party;\n   e. respect the right of all persons to participate in the political process, including minorities and marginalised groups;\n   f. respect and promote human rights and fundamental freedoms, and gender equality and equity;\n   g. promote the objects and principles of this Constitution and the rule of law; and\n   h. subscribe to and observe the code of conduct for political parties.\n\n2. A political party shall not:\n   a. be founded on a religious, linguistic, racial, ethnic, gender or regional basis or seek to engage in advocacy of hatred on any such basis;\n   b. engage in or encourage violence by, or intimidation of, its members, supporters, opponents or any other person;\n   c. establish or maintain a paramilitary force, militia or similar organisation;\n   d. engage in bribery or other forms of corruption; or\n   e. except as is provided under this Chapter or by an Act of Parliament, accept or use public resources to promote its interests or its candidates in elections."
    },
    {
      "number": "92",
      "title": "Legislation on political parties",
      "content": "Parliament shall enact legislation to provide for:\n   a. the reasonable and equitable allocation of airtime, by State owned and other mentioned categories of broadcasting media, to political parties either generally or during election campaigns;\n   b. the regulation of freedom to broadcast in order to ensure fair election campaigning;\n   c. the regulation of political parties;\n   d. the roles and functions of political parties;\n   e. the registration and supervision of political parties;\n   f. the establishment and management of a political parties fund;\n   g. the accounts and audit of political parties;\n   h. restrictions on the use of public resources to promote the interests of political parties; and\n   i. any other matters necessary for the management of political parties."
      }
      ]
    },
    {
  "chapter": "Chapter 8",
  "part": "Part 2: Composition and Membership of Parliament",
  "articles": [
    {
      "number": "97",
      "title": "Membership of the National Assembly",
      "content": "1. The National Assembly consists of:\n  a. Two hundred and ninety members, each elected by the registered voters of single member constituencies;\n  b. Forty-seven women, each elected by the registered voters of the counties, each county constituting a single member constituency;\n  c. Twelve members nominated by parliamentary political parties according to their proportion of members of the National Assembly in accordance with Article 90, to represent special interests including the youth, persons with disabilities and workers; and\n  d. The Speaker, who is an ex officio member.\n2. Nothing in this Article shall be construed as excluding any person from contesting an election under clause (1) (a)."
    },
    {
      "number": "98",
      "title": "Membership of the Senate",
      "content": "1. The Senate consists of:\n  a. Forty-seven members each elected by the registered voters of the counties, each county constituting a single member constituency;\n  b. Sixteen women members who shall be nominated by political parties according to their proportion of members of the Senate elected under clause (a) in accordance with Article 90;\n  c. Two members, being one man and one woman, representing the youth;\n  d. Two members, being one man and one woman, representing persons with disabilities; and\n  e. The Speaker, who shall be an ex officio member.\n2. The members referred to in clause (1) (c) and (d) shall be elected in accordance with Article 90.\n3. Nothing in this Article shall be construed as excluding any person from contesting an election under clause (1) (a)."
    },
    {
      "number": "99",
      "title": "Qualifications and disqualifications for election as member of Parliament",
      "content": "1. Unless disqualified under clause (2), a person is eligible for election as a member of Parliament if the person:\n  a. Is registered as a voter;\n  b. Satisfies any educational, moral and ethical requirements prescribed by this Constitution or by an Act of Parliament; and\n  c. Is nominated by a political party, or is an independent candidate who is supported:\n    i. In the case of election to the National Assembly, by at least one thousand registered voters in the constituency; or\n    ii. In the case of election to the Senate, by at least two thousand registered voters in the county.\n2. A person is disqualified from being elected a member of Parliament if the person:\n  a. Is a State officer or other public officer, other than a member of Parliament;\n  b. Has, at any time within the five years immediately preceding the date of election, held office as a member of the Independent Electoral and Boundaries Commission;\n  c. Has not been a citizen of Kenya for at least the ten years immediately preceding the date of election;\n  d. Is a member of a county assembly;\n  e. Is of unsound mind;\n  f. Is an undischarged bankrupt;\n  g. Is subject to a sentence of imprisonment of at least six months, as at the date of registration as a candidate, or at the date of election; or\n  h. Is found, in accordance with any law, to have misused or abused a State office or public office or in any way to have contravened Chapter Six.\n3. A person is not disqualified under clause (2) unless all possibility of appeal or review of the relevant sentence or decision has been exhausted."
    },
    {
      "number": "100",
      "title": "Promotion of representation of marginalised groups",
      "content": "Parliament shall enact legislation to promote the representation in Parliament of:\n  a. Women;\n  b. Persons with disabilities;\n  c. Youth;\n  d. Ethnic and other minorities; and\n  e. Marginalised communities."
    },
    {
      "number": "101",
      "title": "Election of members of Parliament",
      "content": "1. A general election of members of Parliament shall be held on the second Tuesday in August in every fifth year.\n2. Whenever a vacancy occurs in the office of a member of the National Assembly under Article 97 (1) (c), or of the Senate under Article 98 (1) (b), (c) or (d), the respective Speaker shall, within twenty-one days of the occurrence of the vacancy, give notice in writing of the vacancy to:\n  a. The Independent Electoral and Boundaries Commission; and\n  b. The political party on whose party list the member was elected or nominated.\n3. A vacancy mentioned in clause (2) shall, subject to clause (5), be filled in the manner prescribed by an Act of Parliament within twenty-one days of the notification by the respective Speaker.\n4. Whenever a vacancy occurs in the office of a member of the National Assembly elected under Article 97 (1) (a) or (b), or of the Senate elected under Article 98 (1) (a):\n  a. The respective Speaker shall, within twenty-one days after the occurrence of the vacancy, give notice in writing of the vacancy to the Independent Electoral and Boundaries Commission; and\n  b. A by-election shall be held within ninety days of the occurrence of the vacancy, subject to clause (5).\n5. A vacancy referred to in clause (4) shall not be filled within the three months immediately before a general election."
    },
    {
      "number": "102",
      "title": "Term of Parliament",
      "content": "1. The term of each House of Parliament expires on the date of the next general election.\n2. When Kenya is at war, Parliament may, by resolution supported in each House by at least two-thirds of all the members of the House, from time to time extend the term of Parliament by not more than six months at a time.\n3. The term of Parliament shall not be extended under clause (2) for a total of more than twelve months."
    },
    {
      "number": "103",
      "title": "Vacation of office of member of Parliament",
      "content": "1. The office of a member of Parliament becomes vacant:\n  a. If the member dies;\n  b. If, during any session of Parliament, the member is absent from eight sittings of the relevant House without permission, in writing, from the Speaker, and is unable to offer a satisfactory explanation for the absence to the relevant committee;\n  c. If the member is otherwise removed from office under this Constitution or legislation enacted under Article 80;\n  d. If the member resigns from Parliament in writing to the Speaker;\n  e. If, having been elected to Parliament:\n    i. As a member of a political party, the member resigns from that party or is deemed to have resigned from the party as determined in accordance with the legislation contemplated in clause (2);\n    ii. As an independent candidate, the member joins a political party;\n  f. At the end of the term of the relevant House; or\n  g. If the member becomes disqualified for election to Parliament under Article 99 (2) (d) to (h).\n3. Parliament shall enact legislation providing for the circumstances under which a member of a political party shall be deemed, for the purposes of clause (1) (e), to have resigned from the party."
    },
    {
      "number": "104",
      "title": "Right of recall",
      "content": "1. The electorate under Articles 97 and 98 have the right to recall the member of Parliament representing their constituency before the end of the term of the relevant House of Parliament.\n2. Parliament shall enact legislation to provide for the grounds on which a member may be recalled and the procedure to be followed."
    },
    {
      "number": "105",
      "title": "Determination of questions of membership",
      "content": "1. The High Court shall hear and determine any question whether:\n  a. A person has been validly elected as a member of Parliament; or\n  b. The seat of a member has become vacant.\n2. A question under clause (1) shall be heard and determined within six months of the date of lodging the petition.\n3. Parliament shall enact legislation to give full effect to this Article."
        }
      ]
    }

    ]
  }













]